let data = [
    {
        "name":"ドラマチックじゃなくても",
        "lyrics":[
            "時間よ止まれ 少しだけ","始まりは いつだった? / もう 覚えてないけど",
            "「それもいいか」ってさ / 他愛もない事","いつだって 気がつけば / 笑って泣いたりして",
            "たまに 意地はったりもしたりね","信号が変われば / せーので進む行き先（このまま）",
            "言わなくても（どこまでも） / 行けるよねきっと","ドラマチックじゃなくても / 退屈だと嘆いても",
            "いつかふと思い出す / 今日を ロマンチックな言葉も","無くていいよ だから / 時間よ止まれ 少しだけ 呟いた",
            "なんとなく 怖くなるんだよ / 何でもない日々","急に（いつか） / 終わりが来そうな気がして",
            "分かれ道がきたら / じゃあねと手を振る君に（明日も）","またねって（会えるよね） / 気づいてほしくて",
            "時計の針は進んでも / 戻ることはないけれど","何度でも 夢を見る今日の / 特別な事しなくても",
            "大切な日になるの / 明日もきっとその先も","永遠じゃないと 知ってる事も / 今だけは分からないフリさせて / 少しだけ",
            "ドラマチックじゃなくても / 退屈だと嘆いても","いつかふと思い出す 今日を / ロマンチックな言葉も",
            "無くていいよ だから / 時間よ止まれ 少しだけ / 届くかな","君がそっと 口ずさんだ / あのメロディ",
            "気がつけば一緒になって ラララ / 心がほっと 温まる","こんな気持ち / 届くかな 届けたいな",
            "アニメ：久保さんは僕を許さない","歌手：花澤香菜"
        ]
    },
    {
        "name":"50センチ",
        "lyrics":[
            "隣って言葉は意外と汎用性がある / 例えば1メートル離れてても隣",
            "膠着状態 茜に染まる街で / 本音が知りたい はぐらかして 君が歩けど","気づいて 50センチ圏内(Dou Wah×2) / 私は 50センチ圏外？(Dou Wah×2)",
            "ふたりで 帰るその理由は(Dou Wah×2) / 聞けずに 並んだ影","晴れきった空から予想外の雨の日も / どうしてお互い傘がカバンから出てくる",
            "距離感絶妙 波乱すら呼べないから / 思いが読めない 肩透かしが 君はもう十八番","ほだされ 友情を超えてみない？(Dou Wah×2) / 私は いつでも超えてみたい(Dou Wah×2)",
            "どこまで あやふや心模様(Dou Wah×2) / 見送る 夕陽と答え","あぁ でも空回ってさ / 前のめり転びそうになって",
            "助けてくれるの / そういうとこが好きなんだ","このまま 50センチ圏内(Dou Wah×2) / 私は 50センチ圏外？(Dou Wah×2)",
            "明日も 問いかけたことさえ(Dou Wah×2) / どさくさ 紛れるかな","気づいて 50センチ圏内(Dou Wah×2) / 私は 50センチ圏外？(Dou Wah×2)",
            "ふたりで 帰るその理由は(Dou Wah×2) / 聞けずに　並んだ影",
            "アニメ：それでも歩は寄せてくる","歌手：中村カンナ"
        ]
    },
    {
        "name":"アカシ",
        "lyrics":[
            "例え悪魔に正論かざして向かってみても","それはあくまで正当化 さして違いはないかも",
            "今も今も揺れているけど / 僕らはどこまで行くの","天使のささやきにも似た声が聞こえた",
            "はたまたペテン師のまやかし 一際耳に響いていた","愛に悲哀に晒されながら / 誇りまみれ道の途中",
            "消えては浮かぶ逃避行","飲み込んだSOS","震える手を握り締めた","たった一つの小さな約束が","ほんの些細な思い出たちが",
            "いつまで経ってもこの胸を焦がし続ける灯火になる","ただ一筋の透明な光が","目の前を照らして行く","僕に出来ることは いくつもないさ",
            "信じ抜いた先に手にした未来を進んで行け","平気なふり 命を溶かし燃やす灯","かりそめの想いを濾過して 火をくべるのが照明なら",
            "光るその目に僕は何を問えばいい","脈を打つ胸の鼓動が何よりの証","それをただ息を切らし鳴らし続けることで証明","それをただ息を切らし鳴らし続けることで証明",
            "闇に光に暴かれながら / 共に走れ道の途中","孤独も眠る海の底","風も踊る空の上","遥か願うこの大地で","たった一粒のこぼれた涙も",
            "そっと押し殺した ため息も","脇目もふらぬ君には届かない方がいいだろう","ただ一筋の透明な光よ","どこまでも透き通って行け",
            "僕に出来ることはいくつもないさ / 決して見失わない心を宿して","もしこの世界が全部作られた偽物だとして","与えられた運命は絡まった勘違いだとして","それでも構わないありふれた毎日の中に / 譲れない理由がある",
            "たった一つの小さな約束が","ほんの些細な思い出たちが","いつまで経ってもこの胸を焦がし続ける灯火になる","ただ一筋の透明な光が","目の前を照らして行く","僕に出来ることはいくつもないさ",
            "ここに今が続いていく限り","握った手を離しはしないさ","信じ抜いた先に灯したアカシを掲げて",
            "アニメ：ドラゴンクエスト","歌手：XIIX"
        ]
    },
    {
        "name":"青春コンプレックス",
        "lyrics":[
            "暗く狭いのが好きだった","深く被るフードの中","無情な世界を恨んだ目は","どうしようもなく愛を欲してた",
            "雨に濡れるのが好きだった","曇った顔が似合うから","嵐に怯えてるフリをして","空が割れるのを待っていたんだ",
            "かき鳴らせ / 光のファズで","雷鳴を 轟かせたいんだ","打ち鳴らせ / 痛みの先へ","どうしよう！ / 大暴走獰猛な鼓動を",
            "悲しい歌ほど好きだった","優しい気持ちになれるから","明るい場所を求めていた","だけど触れるのは怖かった",
            "深く潜るのが好きだった","海の底にも月があった","誰にも言わない筈だった","が 歪な線が闇夜を走った",
            "かき鳴らせ / 交わるカルテット","革命を 成し遂げてみたいな","打ち鳴らせ / 嘆きのフォルテ","どうしよう？ / 超奔放凶暴な本性を",
            "私 俯いてばかりだ / それでいい","猫背のまま / 虎になりたいから",
            "かき鳴らせ / 光のファズで","雷鳴を 轟かせたいんだ","打ち鳴らせ / 痛みの先へ","さあいこう / 大暴走獰猛な鼓動を","衝動的感情 吠えてみろ！","かき鳴らせ 雷鳴を",
            "アニメ：ぼっち・ざ・ろっく！","歌手：結束バンド"
        ]
    },
    {
        "name":"SHOCK!",
        "lyrics":[
            "ねえ愛したいこれは真実?","ただ愛されたいのは不誠実?","もうどうすればいい","どうすればいいのか",
            "街はいつも通り今日も","惚れた腫れたで色めきたつ","エキストラは家に帰るだけ","不貞腐れてやしないさ",
            "そんな日々を切り裂くように","突然現れた君は","痺れるような笑顔で僕の","心を砕いて見せた",
            "ねえ愛したいこれは真実?","ただ愛されたいのは不誠実?","もうどうすればいい","どうすればいいのか","って分からないよ",
            "その頭の中が分かんない","でも愛想は良いとかずるいよ","こうやってまた君のペースに飲まれてく","そうやってまたほら振り回されてる",
            "傷付かないように鍵をかけた","扉にもたれて眠りにつく","変われないのは変わらないから","そんなことは分かってるけど",
            "もう何も失いたくなくて","大切なものが増えることに","怯えていた / 情けない僕を","笑い飛ばしてくれよ",
            "さあ愛し愛されていこうぜ","もう馬鹿なフリしていようぜ","まあどうにかなるさ","どうにでもなるだろ","思うがままに",
            "今夜会いに行くけれどいいかい?","いや大した話じゃないよ","これが愛なのか確かめさせてくれ","これからも好きに振り回してくれ","いつまでも好きに振り回してくれ",
            "アニメ：Buddy Daddies","歌手：Ayase"
        ]
    },
    {
        "name":"Time Factor (タイムファクター)",
        "lyrics":[
            "何より大切なものほど","失いたくないと願うほど","悪戯に掌をすり抜けてゆく運命",
            "奪われた時間と心を","取り戻す為の術がまだ","足りないなんて痛いほど分かってる",
            "鏡の中暗く寂しくて","鳴らしたって届かないサイレン","去ってゆく姿を眺めて",
            "硝子よりも脆いはずなのに","鉛玉なら突き破れるのに","引き金を引いて",
            "守るべきものがあって","背負う幾千の願いがあって","このまま風になって","いつか辿り着いてみせるよ",
            "僕らの yeah eh eh","過去と yeah eh eh 現在を yeah eh eh","繋ぐ想いが照らす yeah eh eh 未来 yeah eh eh","重なったヒストリーを抱き放つ光",
            "誰かを守り抜く為なら","犠牲をも厭わないなんてフェイク","善より悪寄りの狭間で揺れ動いてる",
            "孤独に慣れ出した時から","夢にまで憑いて回る悪魔","月明かりだけが僕を導いてくれる",
            "空になった心に蓋して","左眼跨いだ傷痛んで","いっそこのまま消えても",
            "この闇に一筋の光が","温もりに囲まれ いつかまた笑えるように","La la la la la la (oh) / La la la la la la",
            "語り継がれてゆくのは","正しさや過ちだけじゃなく","誰かの生きた命の足跡 笑顔と涙",
            "叶えたい夢があって","誓い合った約束の果てに","このまま光となって","きっと辿り着いてみせるよ",
            "僕らの yeah eh eh","過去と yeah eh eh 現在を yeah eh eh","繋ぐ願いが照らす yeah eh eh 未来 yeah eh eh","重なったヒストリーを抱き放つ光",
            "Yeah eh eh, yeah eh eh","いつかきっと笑い合える日まで","Yeah eh eh, yeah eh eh, wow wow",
            "アニメ：ワールドトリガー","歌手：神はサイコロを振らない"
        ]
    },
    {
        "name":"残響散歌",
        "lyrics":[
            "Da-ta-ra, ta-ra-tat ta","Da-ra-tat ta, da-ra-tat ta",
            "誰が袖に咲く幻花 ただそこに藍を落とした","派手に色を溶かす夜に 銀朱の月を添えて",
            "転がるように風を切って 躓くごとに強くなった","光も痛みも怒りも全部 抱きしめて","選ばれなければ 選べばいい",
            "声よ 轟け 夜のその向こうへ 涙で滲んでた","あんなに遠くの景色まで響き渡れ","何を奏でて? 誰に届けたくて? 不確かなままでいい",
            "どんなに暗い感情も どんなに長い葛藤も","歌と散れ 残響",
            "ただ一人舞う千夜 違えない帯を結べば","派手な色も負かす様に 深紅の香こそあはれ",
            "この先どんなつらい時も 口先よりも胸を張って","抱いた夢の灯りを全部 辿るだけ","逃げ出すため ここまで来たんじゃないだろ?","選ばれなければ 選べばいい",
            "声をからして 燃える花のように 闇間を照らしたら","曖昧過ぎる正解も譜面にして","夜を数えて朝を描く様な 鮮やかな音を鳴らす",
            "どんなに深い後悔も どんなに高い限界も","掻き消して 残響",
            "アニメ：鬼滅の刃","歌手：Aimer"
        ]
    },
    {
        "name":"Force",
        "lyrics":[
            "Take it","We are dreamers / So it's the trigger","自分次第 / その先には dawn, dawn, dawn",
            "それは流星のような","それは草原のような","必然の中の force だ","空前絶後の出会いだ",
            "瞳の奥の方まで強く","触れられたんだ柔らかな宝石に","僕らの明日はまだ見ぬ光","挫けることもあるけど","抜け出そう迷宮 / 止まらない",
            "僕の鼓動が辿り着いた Whoa, whoa","君と未来を守りたいんだ Whoa, whoa (take it)",
            "Fighter その向こう側へ今","Try 君となら そう","Higher 飛び出そう","いつか見失ってしまう前に","君を失ってしまう前に",
            "We are dreamers / So it's the trigger","自分次第 / その先には dawn, dawn, dawn",
            "We are believers / So it's the trigger","さぁ 行こうか / その先には dawn, dawn, dawn",
            "愛想尽かしたの? / 昔の memories","楽しいことだけを / 数えてれば朝はくる","瞳の奥の方まで深く","魅せられたんだ柔らかな宝石に",
            "僕らの明日はまだ見ぬ光","挫けることもあるけど","抜け出そう迷宮 / 止まらない",
            "僕の心を突き動かした Whoa, whoa","君と未来を守りたいんだ Whoa, whoa (take it)",
            "Fighter その向こう側へ今","Try 君となら そう","Higher 飛び出そう","いつか見失ってしまう前に","君を失ってしまう前に",
            "Ooh (oh oh, oh) Oh yeah 飛び出そう","Ah ah ah ah ah 止まらない","流星のような / 草原のような force だな","きっと二度はないな (きっと二度はないな) / そう 最後だ",
            "Filter その向こう側へ","Story teller いつか語ろう","まだ終われない / 夢から覚めてしまう前に",
            "僕の鼓動が辿り着いた Whoa, whoa","君と未来を守りたいんだ Whoa, whoa (take it)",
            "Fighter その向こう側へ今","Try 君となら そう","Higher 飛び出そう","いつか見失ってしまう前に","君を失ってしまう前に",
            "We are dreamers / So it's the trigger","自分次第 / その先には dawn, dawn, dawn",
            "We are believers / So it's the trigger","さぁ 行こうか / その先には dawn, dawn, dawn","Dawn, dawn, dawn",
            "アニメ：ワールドトリガー","歌手：TOMORROW X TOGETHER"
        ]
    },
    {
        "name":"雲外憧憬",
        "lyrics":[
            "手を伸ばした先に / 君の手が待ってること","きっと触れる前からわかってた","触れて気づいた / こんなにも大きい",
            "星を掴む夜の夢が / 妙に現実味を帯びて","僕が言えなかったことば","思い出す間に / 君はもう次の空を / 泳いでるね",
            "ずるいぐらい眩しくて","寂しいぐらい澄んだ色に / 溶けて染みた","何もかもが映し出されてるよ","小さくて大きな / 静かに燃える君の瞳の上","君は今でもあの景色を / 美しいと思う？",
            "理由をつけて生きていけるならそれでいい","誰の言葉かを忘れても","まだどうしての中に佇んでいても","この場所は僕らのものだ　僕らのものだ",
            "僕ら向かうこの先は / いつか言ってた場所だろう","どこからか漏れた光降り注ぐ","君の背中を　ただ追いかけていた",
            "風の語る夜話に / 目を細めた君を見て","聴こえなかった音が / 流れ込んでくる / ざわめく　そして揺れている",
            "預けられた勲章が","今もまだずっと胸に","重くのしかかって","でもそれが少し心地いいんだ / 君となら",
            "過ぎてく道に / 立っているスクリーン","映し出されているのは / 悪い夢ばかりじゃない","痛いぐらい優しかったり / 悲しいぐらい煌めいていたり","その全部が / 混ざり合い僕に触れる",
            "何度も扉　開いて開いても終わらない","急に訪れる夜もある","まだどうしての中に佇んでいても","君を待つ僕らがいる",
            "理由をつけて生きていけるならそれでいい","誰の言葉かを忘れても","まだどうしての中に佇んでいても","この場所は僕らのものだ　僕らのものだ",
            "アニメ：ワールドトリガー","歌手：FantasticYouth"
        ]
    },
    {
        "name":"ドリームトリガー",
        "lyrics":[
            "そして僕たちはこの場所で 一つの 夢を見た...",
            "キミが見てる現実は運命のルーレット たまに良いことあるのかな...","悪いことばかりじゃ ベイルアウト","乾くココロ潤すのは「ユメ」というオアシスなんだ","急停止できないほどにいろいろ求めちゃうangel",
            "あしたというシルエットが colorfulになればいいよね","キミの情熱 引き金にして 飛びたとうよemotion","空に見つけた迷宮のgate(ちず) 目の前に開かれたS・E・K・A・I",
            "満天の星を見つめ 夢を描き 高鳴ってる鼓動を知った","今ここに創造(はじまり)告げる僕らの物語","どこまでも響くように この想い消えぬように 流れ星に願ぅょ",
            "「悩むだけ悩んだでしょ あとは前だけ見てみれば？」","今宵、翼を手に入れてキミに贈るものはmessage","皆だれでもdreamer 誰かのためじゃなくていい","自分の為にイケばいいよ A級[永久]感覚の next stage",
            "たとえ地球でキミだけが孤独になったとしても","ワタシはキミの味方になれるっ","きっとそれも友情(Team)だ","空に見つけた天使のSmile 雲間に差し込んでく光",
            "幾千の時を越えて キミと出逢いどこまでも進むのは","この先に語り継げる 僕らのheavenly","どこまでも続くように この想い消えぬように","夢のトリガー弾くんだ...","空にひろがる宝石のgate(ちず) 目の前に開くのはM・I・R・A・I",
            "満天の星を越えて そして僕ら1つの太陽になって","今ここで輝き続ける僕らの物語","どこまでも導くから この想い消えぬように","流れ星に願ぃを...","夢のトリガー弾くんだ...",
            "アニメ：ワールドトリガー","歌手：Pile"
        ]
    },
    {
        "name":"未来永劫",
        "lyrics":[
            "心に宿した大義で","誰かを守れるのなら","身代わりも厭わないさ","弱さ故に身勝手なボクは",
            "瘡蓋の多さに / 気づかぬまま揺蕩う日々","ボロボロになったスニーカー",
            "一人きりじゃこんなに脆く","力なく立ち竦むけど","月明かりも灯らぬ闇に","キミがいて 側にいて",
            "時には歪み合ったり","許されないような言葉でキミを傷つけたり","ボクも落ち込んだり","今じゃ全て笑い話になるけど",
            "目的地も分からずにただ","ペダルを漕ぎ続けては","世界の端っこに辿り着けると思ってた / 幼き日々",
            "雲一つない空を自由に飛べたら","なんて夢を見てみたり","夕暮れ 意味もなく集まり","大人を真似 肩並べ黄昏れ",
            "移りゆく景色を背に / 惜別の春風","どんなに遠く離れても / 繋がっているから",
            "たわいない話で笑ったり","痛みの理由を分かち合ったり","互いに共鳴し合った光","かけがえの無い時間よ永遠に",
            "春に差す柔らかい温もり","共に過ごす日々 淡雪のように","終わりがあるから意味を成す旅",
            "一人きりじゃこんなに脆く","力なく立ち竦むけど","月明かりも灯らぬ闇に","キミがいて 側にいて",
            "たわいない話で笑ったり","痛みの理由を分かち合ったり","互いに共鳴し合った光","かけがえの無い時間よ永遠に",
            "強くなりたいと願う / 有限の星空","三分の一のボクらが / 繋ないだ掌 / La la la la la la la la",
            "アニメ：ワールドトリガー","歌手：KAMI WA SAIKORO WO FURANAI"
        ]
    },
    {
        "name":"廻廻奇譚",
        "lyrics":[
            "有象無象 人の成り","虚勢 心象 人外 物の怪みたいだ","虚心坦懐 命宿し/あとはぱっぱらぱな中身なき人間","寄せる期待 不平等な人生","才能もない 大乗 非日常が",
            "アニメ：咒术回战","歌手：Eve","怨親平等に没個性","辿る記憶 僕に 居場所などないから","夢の狭間で泣いてないで","どんな顔すればいいか わかってる","だけどまだ応えてくれよ",
            "闇を祓って 闇を祓って","夜の帳が下りたら合図だ","相対して 廻る環状戦","戯言などは 吐き捨ていけと","まだ止めないで まだ止めないで","誰よりも聡く在る 街に生まれし",
            "この正体を 今はただ/呪い呪われた僕の未来を創造して","走って 転んで 消えない痛み抱いては","世界が待ってる この一瞬を","死守選択しかない愛に無常気","従順に従った欠陥の罰"
            ,"Ah 抒情的 感情が 揺らいでいくバグ","声も出せないまま","今はただ応えてくれよ","どんな顔すればいいか わかんないよ","内の脆さに浸って","命を投げ出さないで",
            "極楽往生 現実蹴って 凪いで","Ah 数珠繋ぎなこの果てまでも","Ah 傀儡な誓いのなき百鬼夜行","五常を解いて 五常を解いて","不確かな声を紡ぐアイデア",
            "相殺して 廻る感情線","その先に今 立ち上がる手を",
        ]
    },
    {
        "name":"GIRIGIRI",
        "lyrics":[
            "東から西へ昇る太陽が 今日もキミを照らすから","その為には何を捨ててもいいさ","僕らには守るものがあるから","ギリギリにFly again いくぞ掴め Smile smile smile",
            "ギリギリにStayして叫べ 次の未来期待したい","また虹を描こう","やっと生きてる意味を持って その日々にそれぞれの色盛って","傷の数だけ強くなれるよ","きっと誰かの為だって/感じながらいつだって戦ってる"
            ,"光を集めて照らし 心のゲートを開いてく","僕らにその未来が例えば近づいたなら","Change the new world"
            ,"アニメ：ワールドトリガー","歌手：Sonar Pocket"
        ]
    },
    {
        "name":"LOST IN PARADISE",
        "lyrics":[
            "gotta get it homie gotta move it","If you gonna do it then 他二の次","Everybody just talk nobody really do it","なんならやるまでしとけよ秘密に","誰かと確認なんて不要","自分のジャッジだけでbreak the walls","ド派手なfakeやろうより","Coolにlowにprove them wrong",
            "I won't give up the fight in my life","Cause my life is living for love","And I won't give up the fight in my life","Stand off and groove on time",
            "Tokyo prison, I'm going to relight your feeling","When time gets rough","Night and day are fading","I'm going to relight your feeling","There's no time to explain",
            "Lost in paradise","Night and day are fading out","Keep on dance now. Hey hey"
            ,"アニメ：咒术回战","歌手：ALI feat. AKLO"
        ]
    },
    {
        "name":"紅蓮華",
        "lyrics":[
            "強くなれる理由を知った","僕を連れて進め","泥だらけの走馬灯に酔う/こわばる心","震える手は掴みたいものがある/それだけさ",
            "夜の匂いに (I'll spend all thirty nights)","空睨んでも (staring into the sky)","変わっていけるのは自分自身だけ/それだけさ"
            ,"どうしたって/消せない夢も/止まれない今も","誰かのために強くなれるなら","何度でも 立ち上がれ","世界に打ちのめされて","負ける意味を知った"
            ,"紅蓮の華よ咲き誇れ！/運命を照らして"
            ,"アニメ：鬼滅の刃","歌手：LiSA"
        ]
    },
    {
        "name":"紅蓮の弓矢",
        "lyrics":[
            "Seid ihr das Essen?","Nein, wir sind der Jäger!","踏まれた花の 名前も知らずに","地に墜ちた鳥は 風を待ち侘びる","祈ったところで 何も変わらない","不本意な現状(いま)を変えるのは 戦う覚悟だ",
            "屍踏み越えて 進む意志を 嗤う豚よ","家畜の安寧 虚偽の繁栄 死せる餓狼の「自由」を!",
            "囚われた屈辱は 反撃の嚆矢だ","城壁の其の彼方 獲物を屠る 狩人(Jäger)","迸る 殺意(しょうどう)に 其の身を灼きながら","黄昏に緋を穿つ 紅蓮の弓矢",
            "アニメ：進撃の巨人","歌手：Linked Horizon"
        ]
    },
    {
        "name":"心臓を捧げよ!",
        "lyrics":[
            "これ以上の地獄は無いだろうと信じたかった","されど人類最悪の日は　いつも唐突に...","扉を叩く音は　絶えず酷く無作法で","招かれざる災厄の灯は　悪夢のように…",
            "過ぎし日を裏切る者　奴等は駆逐すべき敵だ","あの日どんな顔で…　瞳で…　俺達を見つめていた…","何を捨てれば悪魔をも凌げる？","命さえ…　魂さえ…　決して惜しくなどはない…",
            "捧げよ！　捧げよ！　心臓を捧げよ！","全ての犠牲は　今この瞬間（とき）のために","捧げよ！　捧げよ！　心臓を捧げよ！","進むべき未来を　その手で切り拓け……",
            "アニメ：進撃の巨人","歌手：Linked Horizon"
        ]
    },
    {
        "name":"恋ノ行方",
        "lyrics":[
            "きゅんきゅんきゅん","U fu fu fu",
            "気づいてしまった","私きっと 恋してるの","運命のいたずら","その一言 ズキュンときたの",
            "あーこれ以上 期待しちゃダメ","今は 二人で夢追いかけて",
            "ピュアピュア 一途な ハートが","フワフワ フワフワ","いけない うっかり みとれちゃう","好きすぎて どうしよう",
            "自分自身に正直に","キレイになってく私を 近くで見てて","Nanana nanana",
            "アニメ：その着せ替え人形は恋をする","歌手：あかせあかり"
        ]
    },
    {
        "name":"Sun Sun Days",
        "lyrics":[
            "燦々 キラリ色した 大切なもの","忘れないから そう この日を","水平線 遥か彼方","落としたため息は 波にさらわれて消えた","蓋した本音 見つけてくれた"
            ,"キミに手を引かれ ゆっくり走り出す","くしゃくしゃに笑うキミを焼き付けて","波打ち際に はねる影ふたつ","鳴らす足音は 明日へと響いてる","燦々 裸足のキミを 追いかけていく"
            ,"心ほどけて しぶきあげた","爛漫 揺れる水面が キラリ染まって","初めて出逢う この感情","真っ直ぐに 夢を見る 奇麗なその瞳","キミのそばで笑ってたいから","Be myself!"
            ,"アニメ：その着せ替え人形は恋をする","歌手：spira spica"
        ]
    },
    {
        "name":"アシタノヒカリ",
        "lyrics":[
             "「ナンノタメ」生きているの?","出ない答え今日もループしてる","「ダレノタメ」響く声が","世界の戸を叩くよ",
            "夢は夢のままでいられずに","青い僕らはただ駆け出した","そこに (そこに) 未来が (未来が) あると信じてた",
            "いくつ願いを犠牲にしても","護るべきものが見つかるなら きっと","ここからスベテ そう はじまるさ","A reason for my life","A reason for your life","逃げない 2度と",
            "アニメ：ワールドトリガー","歌手：AAA"
        ]
    },
    {
        "name":"Centimeter",
        "lyrics":[
            "運命なんて言えない","あと何センチ近づけば良いんだろう","君がいいと言えないまま見つめてる後ろ姿",
            "余裕のない日々です","デートなんて自信がないな","君が眩しい程","僕は情けなくなってく",
            "(会えない時間＋君が笑った瞬間)÷2のこのときめきと","不器用な僕×強がりな君は案外プラスかもって","気づいてしまったら最後",
            "まだね運命なんて言えない","あと何センチ近づけばいいんだろう","僕は君に何をしてあげれるかな",
            "あの日大丈夫って笑顔","あと何センチ先を歩いてんだろう","君がいいと言えば追いつけるのかな 届くのかな",
            "アニメ：彼女、お借りします","歌手：the peggies"
        ]
    },
    {
        "name":"departure!",
        "lyrics":[
             "大地を踏みしめて","君は目覚めていく","天使の微笑みで 連れ出して!",
            "孤独でも 一人じゃないさ","生まれてきたことに","必ず意味がある","優しさに 満ち溢れてる","青い地球(ほし)にありがとう",
            "You can smile again","太陽浴びて","You can fly away","世界は君の 輝きを待ってる",
            "大地を踏みしめて","君は目覚めていく","天使の微笑みで 連れ出して!",'"始まり"はいつでも遅くないさ',"何度でも立ち上がれ!",
            "最後まで あきらめないさ","やり続けることに 必ず意味がある","You just try again","闇を抜けて","You just go away","未来はいつも 僕たちを待ってる",
            "大空駆けぬけて 海原越えて行け","天使の投げキッス 捕まえて!","まだ誰も見たことない世界へ","飛び出そう明日",
            "君は目覚めていく","大地を踏みしめて","天使の微笑みで 連れ出して!","終わらない冒険に出掛けよう","いつまでも どこまでも",
            "流れ落ちる涙 勇気に変えていく","天使の羽広げ 舞い上がれ!","悲しみも痛みも包みこんで","強くなれ明日",
            "何度でも! (you can try!)","何度でも立ち上がれ!",
            "アニメ：HUNTER×HUNTER","歌手：小野正利"
        ]
    },
    {
        "name":"HUNTING FOR YOUR DREAM",
        "lyrics":[
            "どれほど夢に触れている?","目指したモノがある","この手は何を求めてる?","確かなモノを探して","踏み出したら そこに","君を待っている/幾筋もの光が"
            ,"大空も この大地も","全て身体に吸い込め","止まる事ない明日を","追い越して 君は強くなれる","Hunting for your dream!",
            "アニメ：HUNTER×HUNTER","歌手：小野正利"
        ]
    },
    {
        "name":"Reason",
        "lyrics":[
            "いるよ 傍に 一番近く","今は ただそれだけでいいから","いつかそっと 言いかけた","夢の続きを 聞かせてよ","wo woo...",
            "僕らにどんな世界が/道無き道の先に待ってる","声なき声はこのまま/どこにも届かずに消えてゆくの","忘れない 昨日の記憶",
            "消せない 今日の後悔も","投げ捨て がむしゃらに/明日を目指す","朝陽に 照らされた傷 笑い合って","終わること無い旅を 続けよう"
            ,"向かい風と知っていながら","それでも進む理由がある","だから友よ/老いてく為だけに生きるのは/まだ早いだろう","身につけたもの 抱え込んだもの"
            ,"手放した時 始まる何か","上手く生きてく/",
            "アニメ：HUNTER×HUNTER","歌手：ゆず"
        ]
    },
    {
        "name":"流れ星キラリ",
        "lyrics":[
            "La, la, la, la, la. La, la, la, la, la, la, la, la, la, la","空に願いをかける","それは叶わぬ思い","人はそうやっていくつも夜を越えて","明日を探して来たんだろう",
            "君へ想いを馳せる","遠く離れていても","一人こうして見上げる空の先に","いつか 繋がり合える心を信じて",
            "流れ星キラリ（キラリ）","君は夢の中（夢の中）","違う明日探す 今日の道標",
            "一瞬のヒカリ（ヒカリ）","この想いよ届け","君の為に出来る事見つけるのさ（ああ...）","空の彼方まで",
            "アニメ：HUNTER×HUNTER","歌手：ゆず"
        ]
    }
]

const title = document.querySelector(".title");
const lyric1 = document.querySelector('.lyric1');
const lyric2 = document.querySelector('.lyric2');
const lyric3 = document.querySelector('.lyric3');
const moreLyrics = document.querySelector('.btn1');
const showAnswer = document.querySelector('.btn2');
const next = document.querySelector('.btn3');
const p1Score = document.querySelector(".btn4");
const p2Score = document.querySelector(".btn5");
const p1Stat = document.querySelector(".player1");
const p2Stat = document.querySelector(".player2");

let number = 1; //題號
let Qnumber = "";   //第幾題的String
let i;  //隨機物件(歌曲)變數
let song; //歌曲物件
let ly1,ly2,ly3; //隨機歌詞
let ly1num,ly2num,ly3num; //隨機歌詞變數
let p1num = 0; //玩家一分數
let p2num = 0; //玩家二分數
let score = 3; //此題得分
let showLy2 = false; 
let showLy3 = false;

//alert("猜歌大賽規則說明：\n*作答採搶答制，先搶先答\n*一題3分，每題得分依顯示提示數遞減\n*提示主要為歌詞，隨機掉落作品名、歌手名等其他提示");
reset(); //產生第一題

function reset(){
    if(data.length>1){
        i = Math.floor(Math.random() * data.length);
    }else{
        i=0;
    }
    song = data[i];
    ly1num = Math.floor(Math.random() * song.lyrics.length);
    ly2num = Math.floor(Math.random() * song.lyrics.length);
    ly3num = Math.floor(Math.random() * song.lyrics.length);
    check();
    ly1 = song.lyrics[ly1num];
    ly2 = song.lyrics[ly2num];
    ly3 = song.lyrics[ly3num];
    Qnumber = "第"+number+"題：";
    title.textContent = Qnumber;
    lyric1.textContent = ly1;
    lyric2.textContent = "";
    lyric3.textContent = "";
    showLy2 = false;
    showLy3 = false;
    score = 3;
    p1Score.disabled = false;
    p2Score.disabled = false;
}

function check(){
    if(ly2num == ly1num){
        ly2 = song.lyrics[Math.floor(Math.random() * song.lyrics.length)];
        check();
    }
    if(ly3num == ly2num || ly3num == ly1num){
        ly3 = song.lyrics[Math.floor(Math.random() * song.lyrics.length)];
        check();
    }
}

moreLyrics.addEventListener("click",function(e){
    if(showLy2==false){
        lyric2.textContent = ly2;
        showLy2 = true;
        score--;
    }else if(showLy3==false){
        lyric3.textContent = ly3;
        showLy3 = true;
        score--;
    }else{
        alert("No more hints!");
    }
    
})

showAnswer.addEventListener("click",function(e){
    title.textContent = Qnumber + song.name;
})

next.addEventListener("click",function(e){
    number++;
    console.log(song);
    data.splice(i,1);
    console.log(data);
    if(data.length>=1){
        reset();
    }else{
        alert("You have finished all the questions!");
    }

})

p1Score.addEventListener("click",function(e){
    p1num += score;
    p1Score.disabled = true;
    p1Stat.textContent = "玩家1得分："+p1num;
})

p2Score.addEventListener("click",function(e){
    p2num += score;
    p2Score.disabled = true;
    p2Stat.textContent = "玩家2得分："+p2num;
})
/*
console.log("歌名:"+song.name);
console.log(ly1);
console.log(ly2);
console.log(ly3);
*/
